app/controllers/boards_controller.rb

  def create
    @board = current_user.boards.new(board_params)

    if @board.save
---
INSERT INTO "boards" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 20 Mar 2015 21:52:49 UTC +00:00], ["title", "12"], ["updated_at", Fri, 20 Mar 2015 21:52:49 UTC +00:00], ["user_id", 1]]