app/controllers/stocks_controller.rb

INSERT INTO "stocks" ("created_at", "percent_change", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 23 Mar 2015 04:22:09 UTC +00:00], ["percent_change", #<BigDecimal:10357c160,'0.9E0',9(18)>], ["updated_at", Mon, 23 Mar 2015 04:22:09 UTC +00:00]]
---
	 def create
	    @stock = Stock.new
	    data = YahooFinance.quotes(["^GSPC"], [:change_in_percent])[0][:change_in_percent]
	    @stock.percent_change = data

	    if @stock.save

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT 1  [["id", "50"]]
---
	def show
		@stock = Stock.find(params[:id])